DataProcessors/АктыКМ3.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>АктыКМ3</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ЗначенияСвойствОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияСвойствОбъектов</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СвойстваОбъектов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Свойство</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СвойстваОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ВозвратТоваровОтПокупателя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ВозвратТоваровОтПокупателя</Name>
			<BasedOn>
				<xr:Item>Document.РеализацияТоваровУслуг</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
				<xr:Item>AccountingRegister.Финансовый</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыСКонтрагентами</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийВозвратТоваровОтПокупателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сделка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантРасчетаНДС</Name>
					<Comment>Вариант расчета НДС!</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыРасчетаНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредъявленСчетФактура</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВходящегоСчетФактуры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВходящегоСчетаФактуры</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Файл</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Файлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяСписания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаДоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументыПолучены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетУчета</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Финансовый</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РеализацияТовара</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сделка</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяТовародвижения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиТовародвижения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/АктыКМ3/Forms/ФормаСверкаСБухгалтерией/Ext/Form/Module.bsl
Функция ВыполнитьПодключениеКБазе(СоединениеСБазой)
	
	Попытка
		
		Коннектор = Новый COMObject(ПолныеПрава.ПолучитьВерсиюКомОбъекта_Бух() + ".COMConnector");
		// создается объект COM-соединение
		
		Строка = ПолныеПрава.ПолучитьСтрокуПодключения_Бух();
		СоединениеСБазой = Коннектор.Connect(Строка);
	Исключение
		СоединениеСБазой = Неопределено;
		Сообщить("Подключится к базе невозможно! " + Символы.ПС+Строка(ОписаниеОшибки()));
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Процедура СверитьНаСервере()
	
	ТабСверка.Очистить();
	
	СоединениеСБазой = Неопределено;
	
	Если НЕ ВыполнитьПодключениеКБазе(СоединениеСБазой) Тогда
		Возврат;
	КонецЕсли;
	
	ЗапросКеш = Новый Запрос();
	ЗапросКеш.Текст = "ВЫБРАТЬ
	                  |	СтруктурныеЕдиницы.Ссылка,
	                  |	СтруктурныеЕдиницы.НомерТочки
	                  |ИЗ
	                  |	Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
	                  |ГДЕ
	                  |	СтруктурныеЕдиницы.НомерТочки >= 0";
					  
	ТабКеш = ЗапросКеш.Выполнить().Выгрузить();
	
	ЗапросПодкл = СоединениеСБазой.NewObject("Запрос");
	ЗапросПодкл.УстановитьПараметр("ДатаНач", НачалоДня(Объект.ДатаНачала));
	ЗапросПодкл.УстановитьПараметр("ДатаКон", КонецДня(Объект.ДатаОкончания));
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		ЗапросПодкл.УстановитьПараметр("Организация", СоединениеСБазой.Справочники.Организации.НайтиПоРеквизиту("ИНН", Объект.Организация.ИНН));
	Иначе
		ЗапросПодкл.УстановитьПараметр("Организация", СоединениеСБазой.Справочники.Организации.ПустаяСсылка());
	КонецЕсли;	
	ЗапросПодкл.УстановитьПараметр("Коммент", "КМ-3%");
	ЗапросПодкл.УстановитьПараметр("СУчетомУдаленных", СУчетомУдаленных);
	ЗапросПодкл.УстановитьПараметр("Свойство", СоединениеСБазой.ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию("Возврат удален обработкой переноса"));
	ЗапросПодкл.Текст = "ВЫБРАТЬ
						|	ВозвратТоваровОтПокупателя.ПодразделениеОрганизации.Префикс КАК Префикс,
						|	СУММА(ВозвратТоваровОтПокупателя.СуммаДокумента) КАК СуммаДокумента,
						|	НАЧАЛОПЕРИОДА(ВозвратТоваровОтПокупателя.Дата, ДЕНЬ) КАК Дата
						|ИЗ
						|	Документ.ВозвратТоваровОтПокупателя КАК ВозвратТоваровОтПокупателя
						|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
						|		ПО (ВозвратТоваровОтПокупателя.Ссылка = ЗначенияСвойствОбъектов.Объект
						|				И ЗначенияСвойствОбъектов.Свойство = &Свойство)
						|ГДЕ
						|	ВозвратТоваровОтПокупателя.Дата МЕЖДУ &ДатаНач И &ДатаКон
						|	И (ВозвратТоваровОтПокупателя.Проведен = ИСТИНА ИЛИ &СУчетомУдаленных = Истина И ЕстьNULL(ЗначенияСвойствОбъектов.Значение, Ложь) = Истина)
						|	И (ВозвратТоваровОтПокупателя.Организация = &Организация
						|			ИЛИ &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))
						|	И ВозвратТоваровОтПокупателя.Комментарий Подобно &Коммент
                        |
						|СГРУППИРОВАТЬ ПО
						|	ВозвратТоваровОтПокупателя.ПодразделениеОрганизации.Префикс,
						|	НАЧАЛОПЕРИОДА(ВозвратТоваровОтПокупателя.Дата, ДЕНЬ)";
						
						
	ТабБух = Новый ТаблицаЗначений();
	ТабБух.Колонки.Добавить("ТТ", Новый ОписаниеТипов("СправочникСсылка.СтруктурныеЕдиницы"));
	ТабБух.Колонки.Добавить("Дата", Новый ОписаниеТипов("Дата"));
	ТабБух.Колонки.Добавить("СуммаДокумента", Новый ОписаниеТипов("Число"));
	
	Выборка = ЗапросПодкл.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаДоб = ТабБух.Добавить();
		Попытка
			СтрокаКешТТ = ТабКеш.Найти(Число(Выборка.Префикс), "НомерТочки");
		Исключение
			СтрокаКешТТ = Неопределено;
		КонецПопытки;	
		СтрокаДоб.ТТ = ?(СтрокаКешТТ <> Неопределено, СтрокаКешТТ.Ссылка, Неопределено);
		СтрокаДоб.Дата = Выборка.Дата;
		СтрокаДоб.СуммаДокумента = Выборка.СуммаДокумента;
	КонецЦикла;	
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ДатаНач", НачалоДня(Объект.ДатаНачала));
	Запрос.УстановитьПараметр("ДатаКон", КонецДня(Объект.ДатаОкончания));
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("НетОтбораПоОрг", НЕ ЗначениеЗаполнено(Объект.Организация));
	Запрос.УстановитьПараметр("Таб", ТабБух);
	Запрос.Текст = "ВЫБРАТЬ
	               |	Таб.ТТ,
	               |	Таб.Дата,
	               |	Таб.СуммаДокумента
	               |ПОМЕСТИТЬ ВТ_Таб
	               |ИЗ
	               |	&Таб КАК Таб
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЕСТЬNULL(ВЗ_Запрос.Дата, ВТ_Таб.Дата) КАК Дата,
	               |	ВЗ_Запрос.ТорговаяТочка КАК ТТФинансы,
	               |	ЕСТЬNULL(ВЗ_Запрос.Сумма, 0) КАК СуммаФинансы,
	               |	ВТ_Таб.ТТ КАК ТТБух,
	               |	ЕСТЬNULL(ВТ_Таб.СуммаДокумента, 0) КАК СуммаБух
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		НАЧАЛОПЕРИОДА(ЛистУчетаВозвратыИзСейфа.Ссылка.Дата, ДЕНЬ) КАК Дата,
	               |		ЛистУчетаВозвратыИзСейфа.Ссылка.ТорговаяТочка КАК ТорговаяТочка,
	               |		СУММА(ВЫБОР
	               |				КОГДА ЛистУчетаВозвратыИзСейфа.ПолученаСумма <> 0
	               |					ТОГДА ЛистУчетаВозвратыИзСейфа.ПолученаСумма
	               |				ИНАЧЕ ЛистУчетаВозвратыИзСейфа.Сумма
	               |			КОНЕЦ) КАК Сумма
	               |	ИЗ
	               |		Документ.ЛистУчета.АктыКМ3 КАК ЛистУчетаВозвратыИзСейфа
	               |	ГДЕ
	               |		ЛистУчетаВозвратыИзСейфа.Ссылка.Дата МЕЖДУ &ДатаНач И &ДатаКон
	               |		И ЛистУчетаВозвратыИзСейфа.Ссылка.Проведен = ИСТИНА
	               |		И (ЛистУчетаВозвратыИзСейфа.Ссылка.Организация = &Организация
	               |				ИЛИ &НетОтбораПоОрг = ИСТИНА)
	               |		И ЛистУчетаВозвратыИзСейфа.АктПолучен = ИСТИНА
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		НАЧАЛОПЕРИОДА(ЛистУчетаВозвратыИзСейфа.Ссылка.Дата, ДЕНЬ),
	               |		ЛистУчетаВозвратыИзСейфа.Ссылка.ТорговаяТочка) КАК ВЗ_Запрос
	               |		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_Таб КАК ВТ_Таб
	               |		ПО ВЗ_Запрос.Дата = ВТ_Таб.Дата
	               |			И ВЗ_Запрос.ТорговаяТочка = ВТ_Таб.ТТ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Дата";
				   
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ТолькоРасхождения
			И Выборка.СуммаФинансы = Выборка.СуммаБух Тогда
			Продолжить;
		КонецЕсли;	
		СтрокаТаб = ТабСверка.Добавить();
		СтрокаТаб.Дата = Выборка.Дата;
		СтрокаТаб.ТТБухгалтерия = Выборка.ТТБух;
		СтрокаТаб.ТТФинансы = Выборка.ТТФинансы;
		СтрокаТаб.СуммаФинансы = Выборка.СуммаФинансы;
		СтрокаТаб.СуммаБух = Выборка.СуммаБух;
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура Сверить(Команда)
	
	СверитьНаСервере();
	
КонецПроцедуры
